marcory-hub/reprogram-owned-devices/firmware/SAD00006D-ai-cam/yolo11n-detect/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=40
CONFIG_FATFS_LFN_HEAP=y
CONFIG_CAMERA_GC2145=y
CONFIG_GC2145_SUPPORT=y
CONFIG_SCCB_HARDWARE_I2C_PORT1=y
CONFIG_PIPELINE_SKIP_LETTERBOX=y
CONFIG_FLASH_VESPA_DETECT_YOLO11N_S8_V1=y
CONFIG_FLASH_VESPA_DETECT_ESPDET_PICO_VVEL_192x256=y
CONFIG_FLASH_VESPA_DETECT_ESPDET_PICO_VVEL_ONLY_192x256=y
CONFIG_VESPA_DETECT_ESPDET_PICO_VVEL_192x256=y
CONFIG_BOARD_DISPLAY_AUTO_OFF_MS=60000
# CONFIG_BOARD_DISPLAY_USB_PAUSE_AUTO_OFF is not set
CONFIG_BOARD_DISPLAY_USB_SENSE_DISABLED=y
